app/Controllers/CategoriaController.php

SELECT *
FROM `categorias`
---
    public function index()
    {
        $categorias = $this->categoriaModel->findAll();