app/Controllers/EscuelaController.php

        ];

        try {
            $this->escuelaModel->insert($data);
---
INSERT INTO `escuelas` (`codigo`, `nombre`, `direccion`, `telefono`, `email`, `horario`, `estado`, `created_at`, `updated_at`) VALUES ('ESC001', 'Escuela de Manejo Seguro', 'Av. Principal 123, Ciudad', '123-456-7890', 'contacto@escuelasegura.com', 'Lunes a Viernes 8:00 - 18:00', 'activo', '2025-05-30 18:40:22', '2025-05-30 18:40:22')