app/Controllers/PreguntaController.php

            // Obtener las respuestas para cada pregunta
            $respuestaModel = new \App\Models\RespuestaModel();
            foreach ($preguntas as &$pregunta) {
                $respuestas = $respuestaModel->where('pregunta_id', $pregunta['pregunta_id'])->findAll();
---
SELECT *
FROM `respuestas`
WHERE `pregunta_id` = '64'