app/Models/ExamenPreguntaModel.php

SELECT `examenes`.*
FROM `examen_pregunta`
JOIN `examenes` ON `examenes`.`examen_id` = `examen_pregunta`.`examen_id`
WHERE `examen_pregunta`.`pregunta_id` = '66'
---
    public function getExamenesPorPregunta($pregunta_id)
    {
        try {
            $result = $this->db->table('examen_pregunta')
                ->select('examenes.*')
                ->join('examenes', 'examenes.examen_id = examen_pregunta.examen_id')
                ->where('examen_pregunta.pregunta_id', $pregunta_id)
                ->get();