app/Models/ExamenCategoriaModel.php

    public function getCategoriasExamen($examen_id)
    {
        return $this->select('categorias.*')
            ->join('categorias', 'categorias.categoria_id = examen_categoria.categoria_id')
            ->where('examen_categoria.examen_id', $examen_id)
            ->findAll();
---
SELECT `categorias`.*
FROM `examen_categoria`
JOIN `categorias` ON `categorias`.`categoria_id` = `examen_categoria`.`categoria_id`
WHERE `examen_categoria`.`examen_id` = '1'